---
kind: other
id: Methods.T:Autodesk.Revit.DB.DisplacementElement
source: html/d5fe00f5-a633-e546-dceb-c91cf5f8f4cc.htm
---
# DisplacementElement Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.